app/controllers/appointments_controller.rb

    def index
        appointment = Appointment.all
---
SELECT "appointments".* FROM "appointments"

    def create
        appointment = Appointment.create!(create_appointment_params)
---
INSERT INTO "appointments" ("user_id", "physical_therapist_id", "claim", "home_visit", "scheduled", "am_pm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        appointment = find_appointment
        appointment.destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 4]]

    def find_appointment
        appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]