app/controllers/physical_therapists_controller.rb

    def index
        pt = PhysicalTherapist.all
---
SELECT "physical_therapists".* FROM "physical_therapists"

    def create
        pt = PhysicalTherapist.create!(create_physical_therapist_params)
---
INSERT INTO "physical_therapists" ("email", "password_digest", "first_name", "last_name", "profile_picture", "clinic_address", "specialization", "title", "insurances", "home_visits", "about_me", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        pt = find_physical_therapist
        pt.update!(update_physical_therapist_params)
---
UPDATE "physical_therapists" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "physical_therapists"."id" = ?  [["first_name", "electrical"], ["last_name", "engineer"], ["updated_at", "2022-12-15 20:17:55.961034"], ["id", 11]]

    def destroy
        pt = find_physical_therapist
        pt.destroy
---
DELETE FROM "physical_therapists" WHERE "physical_therapists"."id" = ?  [["id", 11]]

    def find_physical_therapist
       pt = PhysicalTherapist.find(params[:id])
---
SELECT "physical_therapists".* FROM "physical_therapists" WHERE "physical_therapists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]