app/controllers/users_controller.rb

    def create
       user = User.create!(create_user_params)
---
INSERT INTO "users" ("username", "password_digest", "email", "first_name", "last_name", "state", "city", "DOB", "insurer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
      user = find_user
      user.update!(update_user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "insurer" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "chrisy"], ["last_name", "ceddy"], ["insurer", "United Health"], ["updated_at", "2022-12-15 18:43:20.999333"], ["id", 3]]

    def destroy
     user = find_user
     user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]

    def find_user
        user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]